IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_sec_bm.cpp
// SIG policy the stock module never offered. See the file header.
static bool    s_bScOnly;
static uint8_t s_MinKeySize = 7;

// Per-connection state, indexed by nrf_sdh_ble_idx_get (S145 connection
// handles are not guaranteed dense). PeerPk is the LESC peer public key
// receive buffer for the keyset: per link, so concurrent pairings cannot
// overwrite each other (the stock dispatcher shares one static buffer).
// The pending reply record preserves the exact application answer, including
// a rejection, across an NRF_ERROR_BUSY retry.
typedef struct {
	ble_gap_lesc_p256_pk_t PeerPk;			// SoftDevice writes the peer key here
	ble_gap_sec_params_t   ReplyParams;		// pending reply parameters
	bool                   bReplyValid;		// a reply is pending retry
	bool                   bReplyReject;	// the pending reply is a rejection
	bool                   bStorePending;	// bond store deferred on busy
	bool                   bStoreNewPeer;	// the pending store allocated the peer id
	uint16_t               StorePeerId;		// peer id of the pending store
	uint16_t               StoreConnHdl;	// connection handle of the pending store
	uint8_t                EncrKeySize;		// negotiated key size, from CONN_SEC_UPDATE
} BtSecBmLink_t;

static BtSecBmLink_t s_Links[CONFIG_NRF_SDH_BLE_TOTAL_LINK_COUNT];

static inline BtSecBmLink_t *LinkGet(uint16_t ConnHdl)
{
	const int idx = nrf_sdh_ble_idx_get(ConnHdl);

	return (idx >= 0 && idx < CONFIG_NRF_SDH_BLE_TOTAL_LINK_COUNT) ?
		   &s_Links[idx] : nullptr;
}

static void LinkReplyClear(uint16_t ConnHdl)
{
	BtSecBmLink_t *pLink = LinkGet(ConnHdl);
	if (pLink != nullptr)
	{
		pLink->bReplyValid  = false;
		pLink->bReplyReject = false;
	}
}

// Procedure bookkeeping and retry flags, one bit per connection.
static int s_FlagSecProc           = PM_CONN_STATE_USER_FLAG_INVALID;
static int s_FlagSecProcPairing    = PM_CONN_STATE_USER_FLAG_INVALID;
static int s_FlagSecProcBonding    = PM_CONN_STATE_USER_FLAG_INVALID;
static int s_FlagAllowRepairing    = PM_CONN_STATE_USER_FLAG_INVALID;
static int s_FlagSecurePendBusy    = PM_CONN_STATE_USER_FLAG_INVALID;
static int s_FlagSecureForceRepair = PM_CONN_STATE_USER_FLAG_INVALID;
static int s_FlagSecureNullParams  = PM_CONN_STATE_USER_FLAG_INVALID;
static int s_FlagReplyPendBusy     = PM_CONN_STATE_USER_FLAG_INVALID;

// ---- Event emission ---------------------------------------------------------

static struct pm_evt NewEvt(enum pm_evt_id EvtId, uint16_t ConnHdl)
{
	struct pm_evt evt;

	memset(&evt, 0, sizeof(evt));
	evt.evt_id      = EvtId;
	evt.conn_handle = ConnHdl;
	evt.peer_id     = im_peer_id_get_by_conn_handle(ConnHdl);

	return evt;
}

static void EvtSend(struct pm_evt *pEvt)
{
	pm_sm_evt_handler(pEvt);
}

static void UnexpectedErrorSend(uint16_t ConnHdl, uint32_t ErrCode)
{
	struct pm_evt evt = NewEvt(PM_EVT_ERROR_UNEXPECTED, ConnHdl);

	evt.error_unexpected.error = ErrCode;
	EvtSend(&evt);
}

static void StorageFullSend(uint16_t ConnHdl)
{
	struct pm_evt evt = NewEvt(PM_EVT_STORAGE_FULL, ConnHdl);

	EvtSend(&evt);
}

// ---- Procedure bookkeeping --------------------------------------------------

static void SecProcStart(uint16_t ConnHdl, bool bSuccess, enum pm_conn_sec_procedure Procedure)
{
	pm_conn_state_user_flag_set(ConnHdl, s_FlagSecProc, bSuccess);
	if (bSuccess)
	{
		pm_conn_state_user_flag_set(ConnHdl, s_FlagSecProcPairing,
									Procedure != PM_CONN_SEC_PROCEDURE_ENCRYPTION);
		pm_conn_state_user_flag_set(ConnHdl, s_FlagSecProcBonding,
									Procedure == PM_CONN_SEC_PROCEDURE_BONDING);

		struct pm_evt evt = NewEvt(PM_EVT_CONN_SEC_START, ConnHdl);
		evt.conn_sec_start.procedure = Procedure;
		EvtSend(&evt);
	}
}

// True while a pairing (not encryption-only) procedure runs on the link.
static bool ProcIsPairing(uint16_t ConnHdl)
{
	return pm_conn_state_user_flag_get(ConnHdl, s_FlagSecProc) &&
		   pm_conn_state_user_flag_get(ConnHdl, s_FlagSecProcPairing);
}

static enum pm_conn_sec_procedure ProcGet(uint16_t ConnHdl)
{
	if (!pm_conn_state_user_flag_get(ConnHdl, s_FlagSecProcPairing))
	{
		return PM_CONN_SEC_PROCEDURE_ENCRYPTION;
	}
	return pm_conn_state_user_flag_get(ConnHdl, s_FlagSecProcBonding) ?
		   PM_CONN_SEC_PROCEDURE_BONDING : PM_CONN_SEC_PROCEDURE_PAIRING;
}

// Common failure emission: report CONN_SEC_FAILED with the in-flight procedure
// and clear the procedure flag.
static void SecFailureSend(uint16_t ConnHdl, uint16_t Error, uint8_t ErrorSrc)
{
	if (!pm_conn_state_user_flag_get(ConnHdl, s_FlagSecProc))
	{
		return;		// no procedure in flight; nothing to report
	}
	pm_conn_state_user_flag_set(ConnHdl, s_FlagSecProc, false);

	struct pm_evt evt = NewEvt(PM_EVT_CONN_SEC_FAILED, ConnHdl);
	evt.conn_sec_failed.procedure = ProcGet(ConnHdl);
	evt.conn_sec_failed.error     = Error;
	evt.conn_sec_failed.error_src = ErrorSrc;
	EvtSend(&evt);
}

static bool AllowRepairing(uint16_t ConnHdl)
{
	return pm_conn_state_user_flag_get(ConnHdl, s_FlagAllowRepairing);
}

static ble_gap_lesc_p256_pk_t *LescPubKeyGet(void)
{
	return BtLescPubKeyGet();
}

static void WriteBufRelease(uint16_t ConnHdl);

// ---- Keyset construction ----------------------------------------------------

// Point the SoftDevice keyset into the pm_peer_data_bonding inside the
// peer_database write buffer, so the distributed keys land directly in the
// structure the store commits. Returns NRF_SUCCESS, NRF_ERROR_BUSY (no buffer
// yet, retried by the pending pump) or an internal error.
static uint32_t SecKeysetFill(uint16_t ConnHdl, uint8_t Role,
							  ble_gap_sec_keyset_t *pKeyset)
{
	struct pm_peer_data peerData;
	uint16_t tempPeerId;

	uint32_t r = pdb_temp_peer_id_get(ConnHdl, &tempPeerId);
	if (r == NRF_SUCCESS)
	{
		r = pdb_write_buf_get(tempPeerId, PM_PEER_DATA_ID_BONDING, 1, &peerData);
	}
	if (r == NRF_ERROR_BUSY)
	{
		return r;
	}
	if (r != NRF_SUCCESS)
	{
		return NRF_ERROR_INTERNAL;
	}

	memset(peerData.bonding_data, 0, sizeof(struct pm_peer_data_bonding));
	peerData.bonding_data->own_role = Role;

	pKeyset->keys_own.p_enc_key  = &peerData.bonding_data->own_ltk;
	pKeyset->keys_own.p_pk       = LescPubKeyGet();
	pKeyset->keys_peer.p_enc_key = &peerData.bonding_data->peer_ltk;
	pKeyset->keys_peer.p_id_key  = &peerData.bonding_data->peer_ble_id;

	BtSecBmLink_t *pLink = LinkGet(ConnHdl);
	if (pLink == nullptr)
	{
		(void)pdb_write_buf_release(tempPeerId, PM_PEER_DATA_ID_BONDING);
		return NRF_ERROR_INVALID_STATE;
	}
	pKeyset->keys_peer.p_pk      = &pLink->PeerPk;

	// The address the peer used at connection establishment; overwritten by
	// the identity if the peer distributes one.
	r = im_ble_addr_get(ConnHdl, &peerData.bonding_data->peer_ble_id.id_addr_info);
	if (r != NRF_SUCCESS)
	{
		(void)pdb_write_buf_release(tempPeerId, PM_PEER_DATA_ID_BONDING);
		return NRF_ERROR_INVALID_STATE;
	}

	return NRF_SUCCESS;
}

// ---- sec params reply (SEC_PARAMS_REQUEST answer) ---------------------------

static uint32_t ParamsReplyPerform(uint16_t ConnHdl, ble_gap_sec_params_t *pSecParams)
{
	uint8_t              role = pm_conn_state_role(ConnHdl);
	uint8_t              secStatus = BLE_GAP_SEC_STATUS_SUCCESS;
	ble_gap_sec_keyset_t keyset;
	uint32_t             r = NRF_SUCCESS;
	bool                 bWriteBufHeld = false;

	memset(&keyset, 0, sizeof(keyset));

	if (role == BLE_GAP_ROLE_INVALID)
	{
		return BLE_ERROR_INVALID_CONN_HANDLE;
	}

#if defined(CONFIG_PM_RA_PROTECTION)
	if (ast_peer_deny_listed(ConnHdl))
	{
		secStatus  = BLE_GAP_SEC_STATUS_REPEATED_ATTEMPTS;
		pSecParams = NULL;
	}
	else
#endif
	if (pSecParams == NULL)
	{
		// Reject pairing.
		secStatus = BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP;
	}
	else
	{
#if defined(CONFIG_SOFTDEVICE_PERIPHERAL)
		if (role == BLE_GAP_ROLE_PERIPH && !AllowRepairing(ConnHdl) &&
			im_peer_id_get_by_conn_handle(ConnHdl) != PM_PEER_ID_INVALID)
		{
			// A bond already exists for an identified peer: ask before the
			// pairing runs (early reject, a stock sdk-nrf-bm improvement).
			// Peers only identified after key distribution are still caught
			// at AUTH_STATUS.
			struct pm_evt evt = NewEvt(PM_EVT_CONN_SEC_CONFIG_REQ, ConnHdl);
			EvtSend(&evt);
			if (!AllowRepairing(ConnHdl))
			{
				secStatus = BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP;
			}
		}
#endif

