IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_sec_bm.cpp
	r = LinkSecureAuthenticate(ConnHdl, pParams);

#if defined(CONFIG_SOFTDEVICE_CENTRAL)
done:
#endif
done_periph:
	// Track retry state for BUSY; remember the call shape for the retry.
	pm_conn_state_user_flag_set(ConnHdl, s_FlagSecurePendBusy, r == NRF_ERROR_BUSY);
	if (r == NRF_ERROR_BUSY)
	{
		pm_conn_state_user_flag_set(ConnHdl, s_FlagSecureForceRepair, bForceRepairing);
		pm_conn_state_user_flag_set(ConnHdl, s_FlagSecureNullParams, bNullParams);
	}

	if (bSendEvents && r != NRF_SUCCESS && r != NRF_ERROR_BUSY &&
		r != NRF_ERROR_INVALID_STATE)
	{
		if (r == NRF_ERROR_TIMEOUT)
		{
			struct pm_evt evt = NewEvt(PM_EVT_CONN_SEC_FAILED, ConnHdl);
			evt.conn_sec_failed.procedure =
				(pParams != NULL && pParams->bond) ? PM_CONN_SEC_PROCEDURE_BONDING
												   : PM_CONN_SEC_PROCEDURE_PAIRING;
			evt.conn_sec_failed.error     = PM_CONN_SEC_ERROR_SMP_TIMEOUT;
			evt.conn_sec_failed.error_src = BLE_GAP_SEC_STATUS_SOURCE_LOCAL;
			EvtSend(&evt);
		}
		else
		{
			UnexpectedErrorSend(ConnHdl, r);
		}
	}

	if (r == NRF_ERROR_BUSY ||
		(r == NRF_ERROR_INVALID_STATE && !pm_conn_state_valid(ConnHdl)))
	{
		r = NRF_SUCCESS;	// BUSY retried by the pump; INVALID_STATE: link gone
	}
	return r;
}

// ---- GAP event handlers -----------------------------------------------------

static void SecParamsRequestProcess(const ble_gap_evt_t *pGapEvt)
{
	if (s_bScOnly && !pGapEvt->params.sec_params_request.peer_params.lesc)
	{
		// Secure Connections Only: reject legacy pairing without asking the
		// application. The failure is reported through AUTH_STATUS.
		(void)sd_ble_gap_sec_params_reply(pGapEvt->conn_handle,
										  BLE_GAP_SEC_STATUS_AUTH_REQ, NULL, NULL);
		return;
	}

#if defined(CONFIG_SOFTDEVICE_PERIPHERAL)
	if (pm_conn_state_role(pGapEvt->conn_handle) == BLE_GAP_ROLE_PERIPH)
	{
		// New security procedure: reset the repairing decision for the link.
		pm_conn_state_user_flag_set(pGapEvt->conn_handle, s_FlagAllowRepairing, false);
		SecProcStart(pGapEvt->conn_handle, true,
					 pGapEvt->params.sec_params_request.peer_params.bond ?
					 PM_CONN_SEC_PROCEDURE_BONDING : PM_CONN_SEC_PROCEDURE_PAIRING);
	}
#endif
	ParamsRequestProcess(pGapEvt->conn_handle,
						 &pGapEvt->params.sec_params_request.peer_params);
}

#if defined(CONFIG_SOFTDEVICE_PERIPHERAL)
static void SecInfoRequestProcess(const ble_gap_evt_t *pGapEvt)
{
	const ble_gap_enc_info_t *pEncInfo = NULL;
	struct pm_peer_data_bonding bondData;
	struct pm_peer_data peerData;
	const uint32_t bufSize = sizeof(bondData);

	uint16_t peerId = im_peer_id_get_by_master_id(
						&pGapEvt->params.sec_info_request.master_id);
	BTBM_TRACE("sec_info_req: by_master_id=%u\r\n", peerId);
	if (peerId == PM_PEER_ID_INVALID)
	{
		peerId = im_peer_id_get_by_conn_handle(pGapEvt->conn_handle);
		BTBM_TRACE("sec_info_req: by_conn_handle=%u\r\n", peerId);
	}
	else
	{
		// The peer may have been unrecognized until now (e.g. random
		// non-resolvable advertising address). Record the discovery.
		im_new_peer_id(pGapEvt->conn_handle, peerId);
	}

	SecProcStart(pGapEvt->conn_handle, true, PM_CONN_SEC_PROCEDURE_ENCRYPTION);

	if (peerId != PM_PEER_ID_INVALID)
	{
		memset(&bondData, 0, sizeof(bondData));
		peerData.bonding_data = &bondData;

		uint32_t r = pds_peer_data_read(peerId, PM_PEER_DATA_ID_BONDING,
										&peerData, &bufSize);
		if (r == NRF_SUCCESS)
		{
			// Reply with own LTK when it is the one the request names. A LESC
			// LTK has an all-zero master id (nothing to compare, and the
			// compare treats a zero id as invalid), so the lesc flag alone
			// selects it, exactly as the stock dispatcher does.
			const ble_gap_enc_key_t *pKey = &bondData.own_ltk;

			if (pGapEvt->params.sec_info_request.enc_info &&
				(pKey->enc_info.lesc ||
				 im_master_ids_compare(&pKey->master_id,
									   &pGapEvt->params.sec_info_request.master_id)))
			{
				pEncInfo = &pKey->enc_info;
			}
		}
		else if (r != NRF_ERROR_NOT_FOUND)
		{
			UnexpectedErrorSend(pGapEvt->conn_handle, r);
		}
	}

	BTBM_TRACE("sec_info_req: peerId=%u enc_req=%u key=%s\r\n",
			 peerId, pGapEvt->params.sec_info_request.enc_info,
			 pEncInfo ? "yes" : "NULL");
	// S145 copies the enc info during the call; the stack buffer is fine.
	uint32_t r = sd_ble_gap_sec_info_reply(pGapEvt->conn_handle, pEncInfo);
	if (r == NRF_ERROR_INVALID_STATE)
	{
		// Another module already replied, or the link is going down; the
		// DISCONNECTED handling catches the latter.
	}
	else if (r != NRF_SUCCESS)
	{
		UnexpectedErrorSend(pGapEvt->conn_handle, r);
	}
	else if (pGapEvt->params.sec_info_request.enc_info && pEncInfo == NULL)
	{
		SecFailureSend(pGapEvt->conn_handle, PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING,
					   BLE_GAP_SEC_STATUS_SOURCE_LOCAL);
	}
}
#endif // CONFIG_SOFTDEVICE_PERIPHERAL

#if defined(CONFIG_SOFTDEVICE_CENTRAL)
// Central receives a Security Request from the peripheral.
static void SecRequestProcess(const ble_gap_evt_t *pGapEvt)
{
	bool bForceRepairing = false;
	bool bNullParams = (s_pSecParams == NULL);

	if (!bNullParams && pm_conn_state_encrypted(pGapEvt->conn_handle))
	{
		struct pm_conn_sec_status req;

		memset(&req, 0, sizeof(req));
		req.bonded         = pGapEvt->params.sec_request.bond;
		req.mitm_protected = pGapEvt->params.sec_request.mitm;
		req.lesc           = pGapEvt->params.sec_request.lesc;
		bForceRepairing    = !sm_sec_is_sufficient(pGapEvt->conn_handle, &req);
	}

	(void)LinkSecure(pGapEvt->conn_handle, bNullParams, bForceRepairing, true);

	// Forward the request to the application, as the stock module does.
	struct pm_evt evt = NewEvt(PM_EVT_PERIPHERAL_SECURITY_REQ, pGapEvt->conn_handle);
	evt.peripheral_security_req = pGapEvt->params.sec_request;
	EvtSend(&evt);
}
#endif // CONFIG_SOFTDEVICE_CENTRAL

static void PairingSuccessSend(const ble_gap_evt_t *pGapEvt, bool bDataStored)
{
	pm_conn_state_user_flag_set(pGapEvt->conn_handle, s_FlagSecProc, false);

	struct pm_evt evt = NewEvt(PM_EVT_CONN_SEC_SUCCEEDED, pGapEvt->conn_handle);
	evt.conn_sec_succeeded.procedure = pGapEvt->params.auth_status.bonded ?
			PM_CONN_SEC_PROCEDURE_BONDING : PM_CONN_SEC_PROCEDURE_PAIRING;
	evt.conn_sec_succeeded.data_stored = bDataStored;
	EvtSend(&evt);
}

