IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_sec_bm.cpp
	SecFailureSend(pGapEvt->conn_handle, error, BLE_GAP_SEC_STATUS_SOURCE_LOCAL);
	LinkReplyClear(pGapEvt->conn_handle);

	BtSecBmLink_t *pLink = LinkGet(pGapEvt->conn_handle);
	if (pLink != nullptr && pLink->bStorePending)
	{
		pLink->bStorePending = false;
		if (pLink->bStoreNewPeer)
		{
			(void)im_peer_free(pLink->StorePeerId);
		}
	}
	WriteBufRelease(pGapEvt->conn_handle);
}

// ---- Retry pumps ------------------------------------------------------------

static void ReplyPendingHandle(uint16_t ConnHdl, void *pCtx)
{
	(void)pCtx;
	ble_gap_sec_params_t *pParams = s_pSecParams;
	BtSecBmLink_t *pLink = LinkGet(ConnHdl);

	if (pLink != nullptr && pLink->bReplyValid)
	{
		// Replay the application reply exactly, including a rejection.
		pParams = pLink->bReplyReject ? NULL : &pLink->ReplyParams;
	}
	(void)ReplyAttempt(ConnHdl, pParams);
}

static void SecurePendingHandle(uint16_t ConnHdl, void *pCtx)
{
	(void)pCtx;
	bool bForce = pm_conn_state_user_flag_get(ConnHdl, s_FlagSecureForceRepair);
	bool bNull  = pm_conn_state_user_flag_get(ConnHdl, s_FlagSecureNullParams);

	(void)LinkSecure(ConnHdl, bNull, bForce, true);
}

static void PendingPumpsRun(void)
{
	(void)pm_conn_state_for_each_set_user_flag(s_FlagReplyPendBusy,
											   ReplyPendingHandle, NULL);
	(void)pm_conn_state_for_each_set_user_flag(s_FlagSecurePendBusy,
											   SecurePendingHandle, NULL);

	for (int i = 0; i < CONFIG_NRF_SDH_BLE_TOTAL_LINK_COUNT; i++)
	{
		if (s_Links[i].bStorePending && pm_conn_state_valid(s_Links[i].StoreConnHdl))
		{
			s_Links[i].bStorePending = false;
			BondStoreAttempt(s_Links[i].StoreConnHdl, s_Links[i].StorePeerId,
							 s_Links[i].bStoreNewPeer);
		}
	}
}

// ---- sm_* API surface (called by peer_manager.c) ----------------------------

extern "C" {

// pm_init calls smd_init right after sm_init. Everything the dispatcher
// initialized lives in this module and is set up in sm_init, so this only
// checks the ordering held.
uint32_t smd_init(void)
{
	return s_bInit ? NRF_SUCCESS : NRF_ERROR_INVALID_STATE;
}

uint32_t sm_init(void)
{
	if (s_bInit)
	{
		return NRF_ERROR_INVALID_STATE;
	}

	if (!BtLescInit())
	{
		return NRF_ERROR_INTERNAL;
	}

	s_FlagSecProc           = pm_conn_state_user_flag_acquire();
	s_FlagSecProcPairing    = pm_conn_state_user_flag_acquire();
	s_FlagSecProcBonding    = pm_conn_state_user_flag_acquire();
	s_FlagAllowRepairing    = pm_conn_state_user_flag_acquire();
	s_FlagSecurePendBusy    = pm_conn_state_user_flag_acquire();
	s_FlagSecureForceRepair = pm_conn_state_user_flag_acquire();
	s_FlagSecureNullParams  = pm_conn_state_user_flag_acquire();
	s_FlagReplyPendBusy     = pm_conn_state_user_flag_acquire();

	if (s_FlagReplyPendBusy == PM_CONN_STATE_USER_FLAG_INVALID)
	{
		LOG_ERR("Could not acquire conn_state user flags. Increase "
				"PM_CONN_STATE_USER_FLAG_COUNT in the pm_conn_state module.");
		return NRF_ERROR_INTERNAL;
	}

#if defined(CONFIG_PM_RA_PROTECTION)
	uint32_t r = ast_init();
	if (r != NRF_SUCCESS)
	{
		return r;
	}
#endif

	s_bInit = true;
	return NRF_SUCCESS;
}

void sm_ble_evt_handler(const ble_evt_t *ble_evt)
{
	const ble_gap_evt_t *pGapEvt = &ble_evt->evt.gap_evt;

	switch (ble_evt->header.evt_id)
	{
	case BLE_GAP_EVT_CONNECTED:
	{
		// Connection handles are recycled. Reset the whole per-link record so
		// no state from a previous connection on this slot (pending reply,
		// deferred store, key size, peer key) can leak into the new one. The
		// structural reset here is the invariant; the per-event clears
		// elsewhere are then belt and braces.
		BtSecBmLink_t *pLink = LinkGet(pGapEvt->conn_handle);
		if (pLink != nullptr)
		{
			memset(pLink, 0, sizeof(*pLink));
		}
		break;
	}

	case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
		SecParamsRequestProcess(pGapEvt);
		break;

#if defined(CONFIG_SOFTDEVICE_PERIPHERAL)
	case BLE_GAP_EVT_SEC_INFO_REQUEST:
		SecInfoRequestProcess(pGapEvt);
		break;
#endif

#if defined(CONFIG_SOFTDEVICE_CENTRAL)
	case BLE_GAP_EVT_SEC_REQUEST:
		SecRequestProcess(pGapEvt);
		break;
#endif

	case BLE_GAP_EVT_AUTH_STATUS:
		AuthStatusProcess(pGapEvt);
		break;

	case BLE_GAP_EVT_CONN_SEC_UPDATE:
		ConnSecUpdateProcess(pGapEvt);
		break;

	case BLE_GAP_EVT_DISCONNECTED:
		DisconnectProcess(pGapEvt);
		break;

	default:
		break;
	}

	// LESC key handling: single delivery point into the lesc module. DHKey
	// computation stays deferred to BtLescRequestHandler in the
	// application main loop.
	BtLescOnBleEvt(ble_evt);

	PendingPumpsRun();
}

void sm_pdb_evt_handler(struct pm_evt *event)
{
	switch (event->evt_id)
	{
	case PM_EVT_FLASH_GARBAGE_COLLECTED:
	case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
	case PM_EVT_PEER_DATA_UPDATE_FAILED:
	case PM_EVT_PEER_DELETE_SUCCEEDED:
	case PM_EVT_PEER_DELETE_FAILED:
		// Storage capacity may have changed; retry pending work.
		PendingPumpsRun();
		break;

	default:
		break;
	}
}

// IOsonata extensions beyond the stock sm ABI.
void BtSecBmScOnlySet(bool bEnable)
{
	s_bScOnly = bEnable;
}

void BtSecBmMinKeySizeSet(uint8_t Size)
{
	if (Size >= 7 && Size <= 16)
	{
		s_MinKeySize = Size;
	}
}

uint32_t sm_sec_params_set(ble_gap_sec_params_t *sec_params)
{
	if (sec_params == NULL)
	{
		s_pSecParams = NULL;
	}
	else
	{
		s_SecParams  = *sec_params;
		s_pSecParams = &s_SecParams;
	}
	return NRF_SUCCESS;
}

uint32_t sm_sec_params_reply(uint16_t conn_handle, ble_gap_sec_params_t *sec_params,
							 const void *context)
{
	if (context == NULL)
	{
		return NRF_ERROR_NULL;
	}

	SecParamsReplyCtx_t *pCtx = (SecParamsReplyCtx_t *)context;

	if (sec_params == NULL)
	{
		pCtx->pSecParams = NULL;			// reject pairing
	}
	else
	{
		pCtx->SecParamsMem = *sec_params;
		pCtx->pSecParams   = &pCtx->SecParamsMem;
	}
	pCtx->bReplyCalled = true;

	uint32_t r = ReplyAttempt(conn_handle, pCtx->pSecParams);
	if (r == NRF_ERROR_BUSY)
	{
		r = NRF_SUCCESS;	// retried by the pending pump
	}
	return r;
}

void sm_conn_sec_config_reply(uint16_t conn_handle, struct pm_conn_sec_config *conn_sec_config)
{
	if (conn_sec_config != NULL)
	{
		pm_conn_state_user_flag_set(conn_handle, s_FlagAllowRepairing,
									conn_sec_config->allow_repairing);
	}
}

uint32_t sm_lesc_public_key_set(ble_gap_lesc_p256_pk_t *public_key)
{
	// The LESC key pair is owned by the lesc module; an externally supplied
	// key is not supported.
	(void)public_key;
	return NRF_ERROR_FORBIDDEN;
}

uint32_t sm_conn_sec_status_get(uint16_t conn_handle, struct pm_conn_sec_status *conn_sec_status)
{
	if (conn_sec_status == NULL)
	{
		return NRF_ERROR_NULL;
	}

