IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_sec_bm.cpp
	uint8_t role = pm_conn_state_role(conn_handle);
	if (role == BLE_GAP_ROLE_INVALID)
	{
		return BLE_ERROR_INVALID_CONN_HANDLE;
	}

	uint16_t peerId = im_peer_id_get_by_conn_handle(conn_handle);

	memset(conn_sec_status, 0, sizeof(*conn_sec_status));
	conn_sec_status->connected      = true;
	conn_sec_status->encrypted      = pm_conn_state_encrypted(conn_handle);
	conn_sec_status->mitm_protected = pm_conn_state_mitm_protected(conn_handle);
	conn_sec_status->bonded         = (peerId != PM_PEER_ID_INVALID);
	conn_sec_status->lesc           = pm_conn_state_lesc(conn_handle);

	if (!conn_sec_status->lesc && peerId != PM_PEER_ID_INVALID &&
		conn_sec_status->encrypted)
	{
		// Encrypted from a stored LESC bond: the link flag only reflects a
		// live pairing, so consult the bond record.
		struct pm_peer_data_bonding bondData;
		struct pm_peer_data peerData;
		const uint32_t bufSize = sizeof(bondData);

		memset(&bondData, 0, sizeof(bondData));
		peerData.bonding_data = &bondData;

		if (pds_peer_data_read(peerId, PM_PEER_DATA_ID_BONDING,
							   &peerData, &bufSize) == NRF_SUCCESS)
		{
			conn_sec_status->lesc = bondData.own_ltk.enc_info.lesc;
		}
	}

	return NRF_SUCCESS;
}

bool sm_sec_is_sufficient(uint16_t conn_handle, struct pm_conn_sec_status *sec_status_req)
{
	struct pm_conn_sec_status status;

	if (sm_conn_sec_status_get(conn_handle, &status) != NRF_SUCCESS)
	{
		return false;
	}

	return (!sec_status_req->connected      || status.connected) &&
		   (!sec_status_req->encrypted      || status.encrypted) &&
		   (!sec_status_req->mitm_protected || status.mitm_protected) &&
		   (!sec_status_req->bonded         || status.bonded) &&
		   (!sec_status_req->lesc           || status.lesc);
}

uint32_t sm_link_secure(uint16_t conn_handle, bool force_repairing)
{
	if (!s_bInit)
	{
		return NRF_ERROR_INVALID_STATE;
	}

	return LinkSecure(conn_handle, s_pSecParams == NULL, force_repairing, false);
}

}	// extern "C"
